projects/06_Custom_Transient_Swirling_BC/case/swirlChamber/system/controlDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     pimpleFoam;

libs
(
    "libtransientSwirlVelocity.so"
);

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         0.1;

deltaT          0.001;

writeControl    timeStep;
writeInterval   20;

purgeWrite      0;

writeFormat     ascii;
writePrecision  6;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;