projects/06_Custom_Transient_Swirling_BC/case/swirlChamber/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          576;
        startFace       150624;
    }
    outlet
    {
        type            patch;
        nFaces          576;
        startFace       151200;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8640;
        startFace       151776;
    }
)

// ************************************************************************* //
