projects/06_Custom_Transient_Swirling_BC/case/swirlChamber/constant/momentumTransport
FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}

simulationType  laminar;