projects/06_Custom_Transient_Swirling_BC/case/swirlChamber/constant/transportProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0] 1e-5;