projects/06_Custom_Transient_Swirling_BC/case/swirlChamber/system/sampleDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      sampleDict;
}

type sets;

libs ("libsampling.so");

interpolationScheme cellPoint;

setFormat raw;

sets
(
    inletLineY
    {
        type uniform;
        axis distance;
        start (-0.1 -0.05 0);
        end   (-0.1  0.05 0);
        nPoints 51;
    }
);

fields
(
    U
);